
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6225081839)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06a74de91e584f523]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b4fa9cfb59fb8ed6]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ef372ea55e63234b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-027284c710a0d8892]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b66a8be9a7ddf00e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d46b412cd4c9c97]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045bc34d7c279cb27]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b113e053f3b1456]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e72ede8507a7ede]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f307d2ae25b4534]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5a36c42816c6a6e]
aws_subnet.rds_subnet: Refreshing state... [id=subnet-0b82a1db37327b596]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e0e6b1c0c1ac041b]
aws_security_group.ecs: Refreshing state... [id=sg-01392c715b6f27337]
aws_security_group.alb: Refreshing state... [id=sg-0ea3a71bbd61c86a8]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/recruit-service-board-tg/454711001d84759e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-031bf5efc3f63faec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dd3ed9e6c5dcdb96]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07700ba4124e8d2ab]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-088311edf380f4573]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f307d2ae25b45341080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05212acebdfd26b46]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09fbc8a2cc5227fc3]
aws_security_group.rds: Refreshing state... [id=sg-01d224fac4c4d51f5]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1730019703]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/recruit-service-board-alb/56d6da1d3ef15356]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f95a65c3fedee2a9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00ecc0f91b532aa39]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c5a36c42816c6a6e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e72ede8507a7ede1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931/1426ab8034eecf22]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "recruit-service-board"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "recruit-service-board"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=recruit-service-board]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=recruit-service-board]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"58164d3f17e3c8bbda0380c4a57811bc13699eae","Vars":{},"WorkflowName":"Terraform"} -->